platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "INPUT0"
    data_type: TYPE_FP32
    dims: [ -1, 4 ]
  }
]
output [
  {
    name: "OUTPUT0"
    data_type: TYPE_FP32
    dims: [ -1,  1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "mux"
      model_version: -1
      input_map {
        key: "mux_in"
        value: "INPUT0"
      }
      output_map {
        key: "mux_xgb_out"
        value: "mux_xgb_out"
      }
      output_map {
        key: "mux_tf_out"
        value: "mux_tf_out"
      }
      output_map {
        key: "mux_sci_1_out"
        value: "mux_sci_1_out"
      }
      output_map {
        key: "mux_sci_2_out"
        value: "mux_sci_2_out"
      }
    },
    {
      model_name: "xgb"
      model_version: -1
      input_map {
        key: "input__0"
        value: "mux_xgb_out"
      }
      output_map {
        key: "output__0"
        value: "xgb_class"
      }
    },
    {
      model_name: "tf"
      model_version: -1
      input_map {
        key: "dense_input"
        value: "mux_tf_out"
      }
      output_map {
        key: "round"
        value: "tf_class"
      }
    },
    {
      model_name: "sci_1"
      model_version: -1
      input_map {
        key: "input__0"
        value: "mux_sci_1_out"
      }
      output_map {
        key: "output__0"
        value: "sci_1_class"
      }
    },
    {
      model_name: "sci_2"
      model_version: -1
      input_map {
        key: "input__0"
        value: "mux_sci_2_out"
      }
      output_map {
        key: "output__0"
        value: "sci_2_class"
      }
    },
    {
      model_name: "combine"
      model_version: -1
      input_map {
        key: "xgb_class"
        value: "xgb_class"
      }
      input_map {
        key: "tf_class"
        value: "tf_class"
      }
      input_map {
        key: "sci_1_class"
        value: "sci_1_class"
      }
      input_map {
        key: "sci_2_class" 
        value: "sci_2_class"
      }
      output_map {
        key: "OUTPUT0"
        value: "OUTPUT0"
      }
    }
  ]
}
parameters: [
  {
    key: "predict_proba"
    value: { string_value: "false" }
  },
  {
    key: "output_class"
    value: { string_value: "false" }
  },
  {
    key: "threshold"
    value: { string_value: "0.5" }
  },
  {
    key: "algo"
    value: { string_value: "ALGO_AUTO" }
  },
  {
    key: "storage_type"
    value: { string_value: "AUTO" }
  },
  {
    key: "blocks_per_sm"
    value: { string_value: "0" }
  }
]

